# ResetServiceExclusionOverrides Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationService..::..ResetServiceExclusionOverrides Method
FabricationService Class See Also
---
Resets the overridden service palette and button exclusions back to default, as defined by the configuration.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public void ResetServiceExclusionOverrides()
```

Visual Basic
---
```text
Public Sub ResetServiceExclusionOverrides
```

Visual C++
---
```text
public:
void ResetServiceExclusionOverrides()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
FabricationService Class
Autodesk.Revit.DB Namespace